fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Бозырь С.Р. 22.07.2025</comment>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияСотрудника</name>
      <type>
        <types>EnumRef.ВКМ_КатегорииСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийГод = НачалоГода(ТекущаяДата());
	
	Для Счетчик = -5 По 5 Цикл
	
	ДобавляемыйГод = ТекущийГод - 31536000 * Счетчик;
	ПредставлениеГода = Сред(Строка(ДобавляемыйГод), 7, 4);
	
	Элементы.Год.СписокВыбора.Добавить(ДобавляемыйГод, ПредставлениеГода);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьДниОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	РассчитатьДниОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ТекущиеДанные.КатегорияСотрудника = ОтпускаСотрудниковСотрудникПриИзмененииНаСервере(ТекущиеДанные.Сотрудник); 
	
КонецПроцедуры

#КонецОбласти

#область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресТЗОтпусков = АнализГрафикаНаСервере();
	
	ПараметрыАнализаГрафика = Новый Структура;
	ПараметрыАнализаГрафика.Вставить("АдресТЗОтпусков", АдресТЗОтпусков);
	ПараметрыАнализаГрафика.Вставить("ГодАнализа", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыАнализаГрафика, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьДниОтпуска()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ПериодОтпуска = ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала;
	
	ТекущиеДанные.ДнейОтпуска = ПериодОтпуска / 86400;
	
КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
	ТЗОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	
	АдресТЗОтпусков = ПоместитьВоВременноеХранилище(ТЗОтпусков, УникальныйИдентификатор);
	
	Возврат АдресТЗОтпусков;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтпускаСотрудниковСотрудникПриИзмененииНаСервере(Сотрудник)
		
	Возврат Сотрудник.КатегорияСотрудника;
	
КонецФункции

#КонецОбласти
